# Aplicação de algoritimos de Machine Learning sobre dataset Titanic do Kaggle

https://www.kaggle.com/competitions/titanic/overview

In [1]:
#importação das bibliotecas e pacotes
import pandas as pd
import numpy as np
import seaborn as sns

In [3]:
#lendo os arquivos
df_test = pd.read_csv('test.csv')

df_train = pd.read_csv('train.csv')

In [4]:
df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [5]:
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# analise estatistica sobre algumas variaveis do dataset de treino

In [8]:
#verificando as idades max e minima dos passageiros
max(df_train['Age']), min(df_train['Age'])

(80.0, 0.42)

In [28]:
#verificando a quantidade de homens e mulheres
frequencia = df_train['Sex'].value_counts()

percentual = df_train['Sex'].value_counts(normalize=True) * 100

In [29]:
dist_freq_qualitativa_sexo = pd.DataFrame({'Frequência': frequencia,
                                           'Porcentagem (%)': percentual})

In [30]:
dist_freq_qualitativa_sexo.rename_axis('Sexo', axis = 'columns', inplace=True)

In [31]:
dist_freq_qualitativa_sexo

Sexo    Frequência  Porcentagem (%)
male           577        64.758698
female         314        35.241302

In [26]:
#criando crosstable a partir das colunas Pclass e Sex

In [43]:
df_train['Pclass'].unique(), df_train['Sex'].unique()

(array([3, 1, 2], dtype=int64), array(['male', 'female'], dtype=object))

In [44]:
classes = {3: 'Terceira',
           1: 'Primeira',
           2: 'Segunda'}

sexo = {'male': 'Masculino',
        'female': 'Feminino'}

In [49]:
frequencia = pd.crosstab(df_train['Pclass'], df_train['Sex'])

frequencia.rename(index = classes, inplace = True)
frequencia.rename(columns = sexo, inplace = True)

frequencia

Sex       Feminino  Masculino
Pclass
Primeira        94        122
Segunda         76        108
Terceira       144        347

In [50]:
percentual = pd.crosstab(df_train['Pclass'], df_train['Sex'], normalize = True) * 100

percentual.rename(index = classes, inplace = True)
percentual.rename(columns = sexo, inplace = True)

percentual

Sex        Feminino  Masculino
Pclass
Primeira  10.549944  13.692480
Segunda    8.529742  12.121212
Terceira  16.161616  38.945006

In [51]:
df_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'class_age'],
      dtype='object')

In [52]:
df_train['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [55]:
df_train['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [57]:
df_train.groupby('Sex')['Survived'].value_counts()

Sex     Survived
female  1           233
        0            81
male    0           468
        1           109
Name: Survived, dtype: int64